000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>ДатаИзменения</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Блокирован</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>СкидочныйКупон</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDNG</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEB_АвторепрайсЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_Выгружать</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_МониторингЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <comment>Использовать серийные номера (подарочные сертификаты)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовара</name>
    <type>
      <types>EnumRef.НазначенияТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовинкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксклюзив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ЭквайринговыеТерминалы/ЭквайринговыеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭквайринговыеТерминалы</name>
  <owners>Catalog.ДоговорыЭквайринга</owners>
  <attributes>
    <name>ДляСчитыванияКард</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезПодключенияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничнаяТорговля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ПодключаемоеОборудованиеРТПовтИсп/Module.bsl
//	LNK 13.02.2020 13:53:59
Функция ПолучитьНоменклатуруПоКоду(КодТовара, УдалитьДополнительныеКолонки = Ложь, ОтключитьСкидочныеКупоны = Ложь, РаботаетФронт = Ложь)	Экспорт

	Перем СтруктураДанных;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСправочник.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) КАК Упаковка,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ТаблицаСправочник.НазначениеТовара КАК НазначениеТовара,
	|	ТаблицаСправочник.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаСправочник.Блокирован
	|		ИЛИ ТаблицаСправочник.ПометкаУдаления КАК Блокирован
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаСправочник
	|ГДЕ
	|	ТаблицаСправочник.Код = &КодТовара
	|	И НЕ(ТаблицаСправочник.ПометкаУдаления
	|				ИЛИ ТаблицаСправочник.ЭтоГруппа)
	|	И ВЫБОР
	|			КОГДА &ОтключитьСкидочныеКупоны = ИСТИНА
	|				ТОГДА НЕ ТаблицаСправочник.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.СкидочныйКупон)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &РаботаетФронт = ИСТИНА
	|				ТОГДА НЕ(ТаблицаСправочник.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|							И ТаблицаСправочник.ИспользоватьСерийныеНомера)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ"
	);
	Запрос.УстановитьПараметр("КодТовара", КодТовара);
	Запрос.УстановитьПараметр("ОтключитьСкидочныеКупоны", ОтключитьСкидочныеКупоны);
	Запрос.УстановитьПараметр("РаботаетФронт", РаботаетФронт);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураДанных = Новый Структура;
			ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(РезультатЗапроса, Выборка, СтруктураДанных);

			Если УдалитьДополнительныеКолонки Тогда

				СтруктураДанных.Удалить("НазначениеТовара");
				СтруктураДанных.Удалить("ТипНоменклатуры");
				СтруктураДанных.Удалить("Блокирован");

			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;

	Возврат СтруктураДанных;

КонецФункции

//	LNK 29.09.2017 09:30:17
Функция ПолучитьНоменклатуруПоШтрихКоду(ШтрихКод, УдалитьДополнительныеКолонки = Ложь, ОтключитьСкидочныеКупоны = Ложь, РаботаетФронт = Ложь)	Экспорт

	Перем СтруктураДанных;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСправочник.Ссылка КАК Номенклатура,
	|	ТаблицаШтрихкоды.Упаковка КАК Упаковка,
	|	ТаблицаШтрихкоды.Характеристика КАК Характеристика,
	|	ТаблицаСправочник.НазначениеТовара КАК НазначениеТовара,
	|	ТаблицаСправочник.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаСправочник.Блокирован
	|		ИЛИ ТаблицаСправочник.ПометкаУдаления КАК Блокирован
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ТаблицаШтрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаСправочник
	|		ПО ТаблицаШтрихкоды.Владелец = ТаблицаСправочник.Ссылка
	|ГДЕ
	|	ТаблицаШтрихкоды.Штрихкод = &Штрихкод
	|	И ТаблицаШтрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|	И ВЫБОР
	|			КОГДА &ОтключитьСкидочныеКупоны = ИСТИНА
	|				ТОГДА НЕ ТаблицаСправочник.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.СкидочныйКупон)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &РаботаетФронт = ИСТИНА
	|				ТОГДА НЕ(ТаблицаСправочник.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
	|							И ТаблицаСправочник.ИспользоватьСерийныеНомера)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ"
	);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("ОтключитьСкидочныеКупоны", ОтключитьСкидочныеКупоны);
	Запрос.УстановитьПараметр("РаботаетФронт", РаботаетФронт);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураДанных = Новый Структура;
			ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(РезультатЗапроса, Выборка, СтруктураДанных);

			Если УдалитьДополнительныеКолонки Тогда

				СтруктураДанных.Удалить("НазначениеТовара");
				СтруктураДанных.Удалить("ТипНоменклатуры");
				СтруктураДанных.Удалить("Блокирован");

			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;

	Возврат СтруктураДанных;

КонецФункции

//	LNK 04.10.2017 11:43:05
Функция ДанныеЭквайринговогоТерминала(ТерминалЭлемент)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТаблицаСправочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование,
	|	ВЫБОР
	|		КОГДА ТаблицаСправочник.ПодключаемоеОборудование = ЗНАЧЕНИЕ(Справочник.ПодключаемоеОборудование.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ТаблицаСправочник.ИспользоватьБезПодключенияОборудования
	|	КОНЕЦ КАК ИспользоватьБезПодключенияОборудования,
	|	ЕСТЬNULL(ТаблицаСправочник.ПодключаемоеОборудование.РежимВиртуальный, ЛОЖЬ) КАК РежимВиртуальный,
	|	ТаблицаСправочник.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ТаблицаСправочник
	|ГДЕ
	|	ТаблицаСправочник.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка", ТерминалЭлемент);

	Результат = Запрос.Выполнить();

	СтруктураВозврата = Новый Структура(
		"ПодключаемоеОборудование, ИспользоватьБезПодключенияОборудования, РежимВиртуальный"
		, Неопределено, Истина, Ложь);

	Если НЕ Результат.Пустой() Тогда

		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);

	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции // ДанныеЭквайринговогоТерминала()
